CONSTRICT_DIALOG_SYSTEM = '''Ты сжимаешь диалог участников бизнес встречи! Тебе важно указать главный смысл 
диалога. Обязательно помечай пользователей которые задали вопрос или выдвинули идею на решении задачи. 
Твой ответ будет использован далее поэтому старайся сохранить контекст'''

CONSTRICT_DIALOG_USER = '''Сожми данный диалог и ОБЯЗАТЕЛЬНО укажи от какого участника была информация:
Мусс Александр Олегович  - (Руководитель подразделения перспективной разработки ДИТР):Ну, всё. Всем спасибо.
Владимир Рябов - (Директор департамента):А, ну спасибо. А, слушай, у Яндекса Зесь, кстати, говорю точно, в Яндекс Клауде прямо есть Тесловэ стол, 32 гига память, между прочим.
Савельева Елена Александровна  - (Руководитель отдела):Спасибо.
Артем Мотовилов - (Дата инженер):Ну, давайте тогда я посмотрю по характеристикам, которые. Ну, то есть по мощностям, которые точно понадобится. Ещё нужно очень важный момент, примерно приблизительный анализ того, сколько пользовательй одновременно будет сделать генерацию.
Владимир Рябов - (Директор департамента):Слушай, если честно, у меня даже приблизительно нет представления. Вот, честно тебе скажу.
Владимир Рябов - (Директор департамента):Точно абсолютно. Кто-то поиграется, Вот. Но до какой степени. То есть тут возможно несколько вариантов использования. Вариант использования номер раз, когда у нас идёт генерация на автомате рубоговоря, после каждой встречи у нас автоматом генерируется Фулаб просто по умолчанию. Это 1 вариант. Вариант номер 2, когда мы заставляем пользователя именно нажимать. Если нужен фулаб, делаем, не нужен, не делаем. Понятно, что 1 вариант он с 1 стороны более нагрузочный, с другой стороны он.
Артем Мотовилов - (Дата инженер):Угу.
Владимир Рябов - (Директор департамента):Дист более дисциплинирующий, наверное, да? Вот, в какой-то сите.
Мусс Александр Олегович  - (Руководитель подразделения перспективной разработки ДИТР):Он не привязан к дисциплине ответственного за встречу. вот так вот, как бы.
Владимир Рябов - (Директор департамента):Исполнительо, да а да.
Мусс Александр Олегович  - (Руководитель подразделения перспективной разработки ДИТР):Да, исполнитель.
Владимир Рябов - (Директор департамента):Вот. Поэтому у меня пока просто. Вот, я не знаю, как это будет выглядеть до конца так о.
Артем Мотовилов - (Дата инженер):А.
Артем Мотовилов - (Дата инженер):Угу. Просто так как мы будем добавлять возможность генерации, то есть расширенные и более конкретизированный. Например, по итогам, вот, если посмотреть за последние, ну, дней 20 записей, около 30 штук. Соответственно, это, вот, 30 запросов, Но явно не будет приходить ни в 1 час, Соответственно, ну, может быть, и будет и 120 запросов. перегенерация. Соответственно, нужно будет как раз таки, вот, плюс минус под количество записей, наверное, да? себя посморю. В общем, давайте тогда я посмотрю как раз таки, уже опираясь на количество записей, потому что пользовательм не может перегенерировать, создать 22 фулоап, ну, 3.
Владимир Рябов - (Директор департамента):Угу.
Артем Мотовилов - (Дата инженер):И уже лимит заканчивается на 1 запись. Соответственно, уже как раз таки можно будет приблизительно оценить, сколько может быть запросов, чтобы понимать. А по мощностям сервера. ну, чтобы, вот, не переплачивать. так как Водт огромная мощность будет стоять, как бы, в простое, например, сутки или двое. Но в пиковой нагрузке это будет нужно. Можно же это распределить. Просто будет добавить очередь по созданию генерации.
Владимир Рябов - (Директор департамента):Какие требования, да?
Владимир Рябов - (Директор департамента):Угу.
Мусс Александр Олегович  - (Руководитель подразделения перспективной разработки ДИТР):Угу. Только хотел сказать, да.
Владимир Рябов - (Директор департамента):Да, именно так.
Артем Мотовилов - (Дата инженер):Данном случае это монолит. Здесь всё в 1 скрипте прописано. Но, соответственно, это будет разбито на микросервер. На микросервисе.
Владимир Рябов - (Директор департамента):Угу.
Владимир Рябов - (Директор департамента):Понял, понял. Это прекрасно. Слушайте, ну, в любом случае по уже выглядит очень достойно. Так что давай быстрее отдаём пользователям и продукт уже. Ну, он уже выглядит достойно. То есть не стыдно точно абсолютно.
Артем Мотовилов - (Дата инженер):Вот.
Артем Мотовилов - (Дата инженер):Угу. Всё, хорошо. Поменял.
Мусс Александр Олегович  - (Руководитель подразделения перспективной разработки ДИТР):Согласен. Артём. и сегодня тогда ждём плоб по этой встрече.
Артем Мотовилов - (Дата инженер):Хорошо.
Владимир Рябов - (Директор департамента):Точно.
Артем Мотовилов - (Дата инженер):Окей, хорошо.
Владимир Рябов - (Директор департамента):Окей. Спасибо ещё раз.
Мусс Александр Олегович  - (Руководитель подразделения перспективной разработки ДИТР):Всё. спасибо.
Владимир Рябов - (Директор департамента):Рад был увидеть всех.
Артем Мотовилов - (Дата инженер):А ещё 1 уточнящий момент. Пока сайт будет запущен, давайте его в чат добавлю. Если что-то можно будетеотвественно посмотреть, потестировать.
Владимир Рябов - (Директор департамента):Давай.
Владимир Рябов - (Директор департамента):Окей, давай.
Мусс Александр Олегович  - (Руководитель подразделения перспективной разработки ДИТР):Давай пароль, админ.
Артем Мотовилов - (Дата инженер):Всё.
Владимир Рябов - (Директор департамента):Да.
Артем Мотовилов - (Дата инженер):Всё. Всего доброго.
Мусс Александр Олегович  - (Руководитель подразделения перспективной разработки ДИТР):Всё.
Владимир Рябов - (Директор департамента):Всего доброго. Бань.
Савельева Елена Александровна  - (Руководитель отдела):Тиба всего добрг.
Мусс Александр Олегович  - (Руководитель подразделения перспективной разработки ДИТР):Хорошего дня. пока. Пока.
Артем Мотовилов - (Дата инженер):До свидани.
'''

CONSTRICT_DIALOG_ASSISTANT = '''
[Владимир Рябов]-(Директор департамента)> упоминает о сервере с 32 гб памяти в Яндекс Клауде.
[Артем Мотовилов]-(Дата инженер)> предлагает анализировать количество записей для определения требований к мощности сервера.
[Мусс Александр Олегович]-(Руководитель подразделения перспективной разработки ДИТР)> подчеркивает независимость Follow Up от дисциплины ответственного за встречу.
[Артем Мотовилов]-(Дата инженер)> обсуждает разбиение скрипта на микросервисы и добавление возможности использования функции генерации индивидуально для пользователя.
[Мусс Александр Олегович]-(Руководитель подразделения перспективной разработки ДИТР)> Указал на ближающую задачу, попросив предоставть Follow Up данной встречи с использованием сервиса.
[Артем Мотовилов]-(Дата инженер)> Предлагает анализировать посещение и будущую работу сервиса для выявления необходимых мощностей сервера.
[Владимир Рябов]-(Директор департамента)> выражает удовлетворение текущим прогрессом и призывает к быстрому предоставлению продукта пользователям.
'''

STREAMING_SYSTEM = '''
Ты собираешь Follow по данной схеме ->
Вступление:
    *Участники: Перечислите участников встречи (если применимо).
Задачи и их решения:
    *Поставленные задачи: Соберите информацию о поставленных задачах, выделите ключевые моменты, такие как создание сервиса, функционал, демонстрация работы системы и предложенные правки.
    *Решения: Укажите, какие решения были приняты для каждой задачи.
Важные замечания:
    *Замечания участников: Выделите сомнения, поддержку, предложенные улучшения или другие важные замечания участников встречи.
Инструкции:
    *Важные инструкции: Если присутствуют конкретные инструкции, укажите их. Например, инструкции по безопасности, авторизации или другие технические указания.
Дедлайны:
    *Указание дедлайнов: Если на встрече обсуждались сроки, внесите их в отчет.
Общий итог встречи:
    *Резюме: Подведите итог встречи, укажите общую позицию участников, действия, которые были предприняты, и общий настрой по результатам встречи.
'''

STREAMING_USER = '''
Собери Follow up по данной встрече:
[Владимир Рябов]-(Директор департамента)> упоминает о сервере с 32 гб памяти в Яндекс Клауде.
[Артем Мотовилов]-(Дата инженер)> предлагает анализировать количество записей для определения требований к мощности сервера.
[Мусс Александр Олегович]-(Руководитель подразделения перспективной разработки ДИТР)> подчеркивает независимость Follow Up от дисциплины ответственного за встречу.
[Артем Мотовилов]-(Дата инженер)> обсуждает разбиение скрипта на микросервисы и добавление возможности использования функции генерации индивидуально для пользователя.
[Мусс Александр Олегович]-(Руководитель подразделения перспективной разработки ДИТР)> Указал на ближающую задачу, попросив предоставть Follow Up данной встречи с использованием сервиса.
[Артем Мотовилов]-(Дата инженер)> Предлагает анализировать посещение и будущую работу сервиса для выявления необходимых мощностей сервера.
[Владимир Рябов]-(Директор департамента)> выражает удовлетворение текущим прогрессом и призывает к быстрому предоставлению продукта пользователям.
'''

STREAMING_ASSISTANT = '''
[Задачи и их решения]

-> Создание сервиса для формирования итогов встреч и автоматической рассылки:
    - Артем Мотовилов представил функционал и продемонстрировал работу системы. 
    - Мусс Александр Олегович выразил удовлетворение и предложил правки. 
    Правки: Анализ сервиса для определения необходимых мощностей сервиса. 

-> Добавление возможности разделения доступов и поиска по дате и времени:
    - Владимир Рябов высказал свое мнение, и Артем Мотовилов согласился с предложениями, планируя внедрить эти функции в систему.

-> Добавление возможности просмотра исходника и отредактированной записи:
    - Владимир Рябов поддержал предложение и задал вопросы по техническим характеристикам и архитектуре системы.
    Вопросы: Необходимые мощности сервера для работы сервиса. 
    - Артем Мотовилов объяснил процесс авторизации и обсудил вопросы безопасности. 

[Важные замечания]
    - Мусс Александр Олегович высказал сомнения относительно добавления слишком многих функций.
    - Важно обратить внимание на интеграцию с другими приложениями, по замечаниям Мусса Александра Олеговича.

[Инструкции]
    - Нет конкретных инструкций, однако обсуждались вопросы безопасности, авторизации и технических характеристик системы.

[Дедлайны]
    - В ближайщее время Артём Мотовилов должен присать Follow Up данной встречи используя сервис
    - Артем Мотовилов обещал прислать готовую версию для тестирования.

[Общий итог встречи]
    - Обсуждены задачи и функционал сервиса.
    - Внесены правки и предложены улучшения, которые получили поддержку от участников.
    - Заданы вопросы по безопасности и техническим характеристикам системы.
    - Заключено, что продукт готовится к запуску, и ожидается предоставление готовой версии для тестирования.
'''

